from aiogram import Router, types
from aiogram.filters import Command

router = Router()

@router.message(Command("start"))
async def cmd_start(message: types.Message):
    """
    Привітальне повідомлення, яке зʼявляється при запуску бота.
    """
    await message.answer(
        "👋 Привіт! Я — FlashBot.\n\n"
        "Моя мета — допомогти тобі вчитись ефективніше.\n"
        "Я можу перетворювати текст лекцій у флеш-картки для самоперевірки.\n\n"
        "🧠 Просто скористайся командою /generate, щоб надіслати текст лекції.\n\n"
        "ℹ️ Щоб дізнатись про всі доступні команди — напиши /help."
    )


@router.message(Command("help"))
async def cmd_help(message: types.Message):
    """
    Відповідь на команду /help — короткий опис усіх можливостей.
    """
    await message.answer(
        "📚 *Список доступних команд:*\n\n"
        "✅ /start — почати роботу з ботом\n"
        "💡 /generate — створити флеш-картки з тексту лекції\n"
        "ℹ️ /help — показати довідку\n\n"
    )
